app/controllers/instruments_controller.rb

  def index
    @instruments = Instrument.all.order("created_at DESC")
---
SELECT "instruments".* FROM "instruments" ORDER BY created_at DESC

  def create
    @instrument = current_user.instruments.build(instrument_params)

    respond_to do |format|
      if @instrument.save
---
INSERT INTO "instruments" ("brand", "model", "description", "condition", "color", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @instrument.update(instrument_params)
---
UPDATE "instruments" SET "updated_at" = ?, "image" = ? WHERE "instruments"."id" = ?  [["updated_at", "2022-07-15 04:36:44.784376"], ["image", "\"5777443426d34f1857a0e6aa928f572a.jpeg\""], ["id", 3]]

  def destroy
    @instrument.destroy
---
DELETE FROM "instruments" WHERE "instruments"."id" = ?  [["id", 1]]

    def set_instrument
      @instrument = Instrument.find(params[:id])
---
SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]