app/controllers/line_items_controller.rb

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-07-19 07:23:16.594856"], ["updated_at", "2022-07-19 07:23:16.594856"]]
INSERT INTO "line_items" ("instrument_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["instrument_id", 6], ["cart_id", 5], ["created_at", "2022-07-19 07:22:11.689081"], ["updated_at", "2022-07-19 07:22:11.689081"], ["quantity", 1]]
UPDATE "line_items" SET "updated_at" = ?, "quantity" = ? WHERE "line_items"."id" = ?  [["updated_at", "2022-07-19 07:22:34.207729"], ["quantity", 2], ["id", 1]]
---
  def create
    instrument = Instrument.find(params[:instrument_id])
    @line_item = @cart.add_instrument(instrument)

    respond_to do |format|
      if @line_item.save